require "Logic/LuaReader"

local AssetManager = {}
local this = AssetManager

---------------------------------------------------------------------------
--成员变量
---------------------------------------------------------------------------

---------------------------------------------------------------------------
--获取资源
---------------------------------------------------------------------------
function AssetManager.Get(global_id)
	return LuaReader.Get(global_id)
end
---------------------------------------------------------------------------
--获取指定类型的所有资源
---------------------------------------------------------------------------
function AssetManager.GetMessagesByType(message_type)
	return LuaReader.GetMessagesByType(message_type)
end
---------------------------------------------------------------------------
return AssetManager


